from nonebot import on_command, CommandSession
import nonebot
import sys
import requests
import datetime
import time
msg = [["01月05日", "教授之日", ], ["01月06日", "灵梦之日", ], ["01月07日", "雏之日", ], ["01月09日", "衣玖桑之日", ], ["01月10日", "灵异传之日", ], ["01月10日", "椛之日", ], ["02月02日", "普通的魔法使之日", ], ["02月06日", "封魔录之日", ], ["02月07日", "神子大人之日", ], ["02月08日", "爱莲之日", ], ["02月09日", "梦时空之日", ], ["02月10日", "布都之日", ], ["02月10日", "荷取之日", ], ["02月10日", "二岩之日", ], ["02月10日", "Neet之日", ], ["02月18日", "猯藏之日", ], ["02月18日", "爱莲之日", ], ["02月23日", "幽幽子之日", ], ["02月28日", "爱莲之日", ], ["02月29日", "腐肉之日", ], ["03月01日", "蕾蒂与灵梦之日", ], ["03月02日", "桑妮·米尔克之日", ], ["03月03日", "雏祭", ], ["03月04日", "Myon之日", ], ["03月05日", "巫女之日", ], ["03月05日", "丰聪耳神子之日", ], ["03月07日", "早苗酱之日", ], ["03月08日", "命莲之日 ", ], ["03月09日", "洩矢大人之日", ], ["03月10日", "觉之日", ], ["03月10日", "萨丽爱尔之日", ], ["03月12日", "神子与屠自古之日", ], ["03月18日", "因幡之日", ], ["03月18日", "神主生日", ], ["03月20日", "神子与布都之日", ], ["03月21日", "桑妮·米尔克之日", ], ["04月06日", "妖梦之日", ], ["04月06日", "妖梦与露米娅之日", ], ["04月07日", "妖梦与露米娅之日", ], ["04月10日", "帕露西之日", ], ["04月28日", "静叶之日", ], ["04月30日", "白泽之日", ], ["05月01日", "Conparo祭", ], ["05月03日", "Melee之日", ], ["05月05日", "怪绮谈之日", ], ["05月05日", "心之日", ], ["05月06日", "心之日", ], ["05月10日", "小兔姬之日", ], ["05月14日", "恋之日", ], ["05月15日", "美铃之日", ], ["05月15日", "恋心之日", ], ["05月16日", "恋色之日", ], ["05月26日", "心之日", ], ["05月26日", "东方心绮楼之日", ], ["06月01日", "村纱与一轮之日", ], ["06月04日", "莉格露之日", ], ["06月05日", "纯狐之日", ], ["06月06日", "赤蛮奇之日", ], ["06月07日", "露米娅之日", ], ["06月09日", "帕秋莉之日", ], ["06月09日", "神玉之日", ], ["06月10日", "没赶上帕秋莉之日的人们的节日", ], ["06月11日","伞之日(注)", ], ["06月14日", "萝莉恋恋日", ], ["06月15日", "包子仙之日", ], ["06月16日", "魔爱之日", ], ["06月24日", "鵺之日", ], ["07月04日", "芙兰之日", ], ["07月04日", "无名角色之日", ], ["07月06日", "南无三之日", ], ["07月06日", "莉莉卡之日（第一次）", ], ["07月07日", "露米娅之日", ], ["07月07日", "魔理沙之日", ], ["07月09日", "文⑨之日", ], ["07月12日", "衣玖大人之日", ], ["07月14日", "幽香之日", ], ["07月14日", "幽文之日", ], ["07月16日", "七色人偶使之日", ], ["07月20日", "娜兹玲之日", ], ["08月03日", "八坂神奈子之日", ], ["08月03日", "明罗之日", ], ["08月04日", "屠自古之日", ], ["08月04日", "桥姬之日", ], ["08月04日", "响子之日", ], ["08月05日", "八意永琳之日", ], ["08月05日", "秦心之日", ], ["08月06日", "妖梦之日", ], ["08月06日", "文与灵梦之日", ], ["08月07日", "黑谷山女之日", ], ["08月08日", "莉莉卡之日（第二次）", ], ["08月08日", "超级八桥之日", ], ["08月09日", "厄神之日", ], ["08月09日", "博丽之日", ], ["08月10日", "姬海棠之日", ], ["08月12日", "露娜萨之日", ], ["08月17日", "东方风神录之日", ], ["08月17日", "青蛙之日", ], ["08月20日", "文与荷取之日", ], ["08月21日", "Perfect之日", ], ["09月06日", "诹访子之日", ], ["09月06日", "文与早苗之日", ], ["09月08日", "辉夜之日", ], ["09月09日", "九十九姐妹之日", ], ["09月09日", "易者之日", ], ["09月09日", "琪露诺之日", ], ["09月10日", "云居一轮之日", ], ["09月10日", "蜥蜴祭", ], ["09月13日", "东方蓝染日和", ], ["09月19日", "琪露诺之日", ], ["09月19日", "九十九姐妹之日", ], ["09月19日", "小伞之日", ], ["09月30日", "胡桃之日", ], ["09月30日", "香霖堂发售纪念日", ], ["10月03日", "哆来咪之日", ], ["10月04日", "辉夜之日", ], ["10月04日", "天子之日", ], ["10月04日", "丰姬之日", ], ["10月05日", "天子之日", ], ["10月06日", "没赶上天子之日的人们的节日", ], ["10月07日", "是这样吗？之日", ], ["10月09日", "天狗之日", ], ["10月09日", "阿求之日", ], ["10月10日", "Super一轮time", ], ["10月10日", "橙之日", ], ["10月10日", "东方神灵庙之日", ], ["10月15日", "魔爱之日", ], ["10月25日", "屠自古之日", ], ["10月26日", "阿空之日", ], ["10月26日", "蕾米与空之日", ], ["10月28日", "恋恋×2之日", ], ["11月10日", "琪斯美之日", ], ["11月11日", "御柱之日", ], ["11月11日", "四张符卡之日", ], ["11月11日", "东方百奇之日", ], ["11月11日", "古明地觉之日", ], ["11月24日", "妖梦之日", ], ["12月09日", "秘封俱乐部之日", ], ["12月10日", "一轮与布都之日", ], ["12月21日", "无表情之日", ], ["12月24日", "厄神的平安夜"], ["12月25日", "厄神的圣诞节"]]

def get5days(now):
    tm,td=now.month,now.day
    ret=[]
    for i in msg:
        dat=i[0]
        # print(dat)
        m,d=int(dat[0:2]),int(dat[3:5])
        if len(ret)<5:
            if m>tm or m==tm and d>=td:
                ret.append([i[0],i[1]])
                if m==tm and d==td:
                    # print(ret)
                    ret[-1][0]="今天"
    for i in msg:
        if len(ret) < 5:
            ret.append(i)
    s="车万节日提示：\n"
    for i in ret:
        s+=i[0]+' '+i[1]+"\n"
    return s.rstrip()
            
@on_command('THdays', aliases=('节日',), only_to_me=False)
async def recognize(session: CommandSession):
    await session.send(get5days(datetime.datetime.today()))


@nonebot.scheduler.scheduled_job('cron', day_of_week="0-6", hour=0)
async def cb():
    bot_ = nonebot.get_bot()
    try:
        await bot_.send_private_msg(user_id=940012978, message="早安")
        await bot_.send_group_msg(group_id=686922858, message="早安")
        time.sleep(1)
        # await bot_.send_private_msg(user_id=940012978, message=awesome.THdays.get5days())
        await bot_.send_group_msg(group_id=686922858, message=get5days(datetime.datetime.today()))
    except Exception as e:
        nonebot.logger.exception(e)
